# IS 362 – Project 3  

Your assignment involves combining information from a number of SQL tables, 
then displaying the information in a pandas DataFrame. 
For your relational database management system, you may use any RDBMS, 

including MySQL, PostgreSQL, sqlite, or any of the other RDMBSs supported by 
the database in Step 1 below.   
1.  For your database, you should download and install the appropriate version 

of the Chinook database for your RDBMS, which is available here, under the 
downloads tab: https://chinookdatabase.codeplex.com/ 
2.  Your task is to create a pandas DataFrame that displays Customers’ Last 
Name and First Name, and each customer’s purchased Track names and 
Album Titles.  The information should be sorted by Customer LastName 
then Customer FirstName.

Start by importing any modules needed for this assignment as well as an image displaying the sql schema we'll be working with

In [1]:
import pandas as pd
import sqlite3
from IPython.display import Image

Image(url='http://lh4.ggpht.com/_oKo6zFhdD98/SWFPtyfHJFI/AAAAAAAAAMc/GdrlzeBNsZM/s800/ChinookDatabaseSchema1.1.png')

Next step involves connecting to the database

In [2]:
con = sqlite3.connect("Chinook_Sqlite.sqlite")

Now that we've connected to the sqlite database, we'll write a script that will get the exact information that we are looking for

In [3]:
sql = '''SELECT Customer.LastName, Customer.FirstName, Track.Name, Album.Title
         FROM Customer
         LEFT JOIN Invoice
         ON Customer.CustomerId = Invoice.CustomerId
         LEFT JOIN InvoiceLine
         ON Invoice.InvoiceId = InvoiceLine.InvoiceId
         LEFT JOIN Track
         ON InvoiceLine.TrackId = Track.TrackId
         LEFT JOIN Album
         ON Track.AlbumId = Album.AlbumId
         ORDER BY Customer.LastName, Customer.FirstName'''

Now that we've connected to the database, and written the SQL query that will get us the data we need, let's put it all in a pandas DataFrame!

In [4]:
pd.read_sql_query(sql , con=con).head()

  LastName FirstName                                               Name                    Title
0  Almeida   Roberto                            Right Next Door to Hell      Use Your Illusion I
1  Almeida   Roberto                                     In The Evening  In Through The Out Door
2  Almeida   Roberto                                   Fool In The Rain  In Through The Out Door
3  Almeida   Roberto  Saudade Dos Aviões Da Panair (Conversando No Bar)                    Minas
4  Almeida   Roberto                             Caso Você Queira Saber                    Minas